# GetStructuralSection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbol..::..GetStructuralSection Method
FamilySymbol Class See Also
---
Gets the structural section from element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public StructuralSection GetStructuralSection()
```

Visual Basic
---
```text
Public Function GetStructuralSection As StructuralSection
```

Visual C++
---
```text
public:
StructuralSection^ GetStructuralSection()
```

# ### Return Value
The structural section. nullNothingnullptra null reference (Nothing in Visual Basic) if the family symbol does not contain a structural section.
# Remarks
Only beams, braces and structural columns can have a structural section. To check if the element can have structural section use the [!:Family.HasStructuralSection()] method.
# See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace